Revit 2027 API
ExporterIFCUtils.GetGlobal3DOriginHandle Method
 Obtains the handle representing the 3D origin.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCAnyHandle GetGlobal3DOriginHandle()
Public Shared Function GetGlobal3DOriginHandle As IFCAnyHandle
public:
static IFCAnyHandle^ GetGlobal3DOriginHandle()
static member GetGlobal3DOriginHandle : unit -> IFCAnyHandle
Return Value
IFCAnyHandle
 The handle.
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace